chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D33.xml
        <register>
          <name>OVR1CTRL</name>
          <description>Overlay1 DMA Control Register</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFETCH</name>
              <description>Lookup Table Fetch Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1NEXT</name>
          <description>Overlay1 DMA Next Register</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG0</name>
          <description>Overlay 1 Configuration 0 Register</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIF</name>
              <description>Source Interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN</name>
              <description>AHB Burst Length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_BLEN_SINGLE</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR4</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR8</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR16</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLBO</name>
              <description>Defined Length Burst Only for Channel Bus Transaction.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTDIS</name>
              <description>Hardware Rotation Optimization Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKDIS</name>
              <description>Hardware Rotation Lock Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG1</name>
          <description>Overlay 1 Configuration 1 Register</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Lookup Table Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGBMODE</name>
              <description>RGB Input Mode Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>12BPP_RGB_444</name>
                  <description>12 bpp RGB 444</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_ARGB_4444</name>
                  <description>16 bpp ARGB 4444</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_RGBA_4444</name>
                  <description>16 bpp RGBA 4444</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_RGB_565</name>
                  <description>16 bpp RGB 565</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BPP_TRGB_1555</name>
                  <description>16 bpp TRGB 1555</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18BPP_RGB_666</name>
                  <description>18 bpp RGB 666</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18BPP_RGB_666PACKED</name>
                  <description>18 bpp RGB 666 PACKED</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19BPP_TRGB_1666</name>
                  <description>19 bpp TRGB 1666</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19BPP_TRGB_PACKED</name>
                  <description>19 bpp TRGB 1666 PACKED</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24BPP_RGB_888</name>
                  <description>24 bpp RGB 888</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24BPP_RGB_888_PACKED</name>
                  <description>24 bpp RGB 888 PACKED</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25BPP_TRGB_1888</name>
                  <description>25 bpp TRGB 1888</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BPP_ARGB_8888</name>
                  <description>32 bpp ARGB 8888</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BPP_RGBA_8888</name>
                  <description>32 bpp RGBA 8888</description>
                  <value>0xD</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLUTMODE</name>
              <description>Color Lookup table input mode selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLUT_1BPP</name>
                  <description>color lookup table mode set to 1 bit per pixel</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_2BPP</name>
                  <description>color lookup table mode set to 2 bits per pixel</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_4BPP</name>
                  <description>color lookup table mode set to 4 bits per pixel</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_8BPP</name>
                  <description>color lookup table mode set to 8 bits per pixel</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG2</name>
          <description>Overlay 1 Configuration 2 Register</description>
          <addressOffset>0x00000174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPOS</name>
              <description>Horizontal Window Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPOS</name>
              <description>Vertical Window Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG3</name>
          <description>Overlay 1 Configuration 3 Register</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XSIZE</name>
              <description>Horizontal Window Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YSIZE</name>
              <description>Vertical Window Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG4</name>
          <description>Overlay 1 Configuration 4 Register</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG5</name>
          <description>Overlay 1 Configuration 5 Register</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSTRIDE</name>
              <description>Pixel Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG6</name>
          <description>Overlay 1 Configuration 6 Register</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDEF</name>
              <description>Blue Default</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDEF</name>
              <description>Green Default</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDEF</name>
              <description>Red Default</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG7</name>
          <description>Overlay 1 Configuration 7 Register</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKEY</name>
              <description>Blue Color Component Chroma Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GKEY</name>
              <description>Green Color Component Chroma Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RKEY</name>
              <description>Red Color Component Chroma Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG8</name>
          <description>Overlay 1 Configuration 8Register</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMASK</name>
              <description>Blue Color Component Chroma Key Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMASK</name>
              <description>Green Color Component Chroma Key Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMASK</name>
              <description>Red Color Component Chroma Key Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG9</name>
          <description>Overlay 1 Configuration 9 Register</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRKEY</name>
              <description>Blender Chroma Key Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Blender Inverted Blender Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER2BL</name>
              <description>Blender Iterated Color Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>Blender Use Iterated Color</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REVALPHA</name>
              <description>Blender Reverse Alpha</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAEN</name>
              <description>Blender Global Alpha Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LAEN</name>
              <description>Blender Local Alpha Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Blender Overlay Layer Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Blender DMA Layer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REP</name>
              <description>Use Replication logic to expand RGB color to 24 bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTKEY</name>
              <description>Destination Chroma Keying</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GA</name>
              <description>Blender Global Alpha</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CHER</name>
          <description>Overlay 2 Channel Enable Register</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel Enable Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UPDATEEN</name>
              <description>Update Overlay Attributes Enable Register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>A2QEN</name>
              <description>Add Head Pointer Enable Register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CHDR</name>
          <description>Overlay 2 Channel Disable Register</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHRST</name>
              <description>Channel Reset Register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
